//Сотніков Олег 141
//Описати функцію TriangleP (a, h), що знаходить периметр рівнобедреного трикутника за його основою a і висотою h, проведеною до
//основи (a і h - дійсні). За допомогою цієї функції знайти периметри трьох трикутників, для яких дані основи і висоти. Для знаходження
//сторони b трикутника використовувати теорему Піфагора:b2 = (a / 2) 2 + h2.
#include <iostream>
#include <cmath>

using namespace std;

void TriangleP(double a, double h)
{
    double b, P;
    b = (a / 2) * (a / 2) + h * h;
    b = sqrt(b);
    P = 2 * b + a;
    cout << "Сторона треугольника равна: ";
    cout << b << endl;
    cout << "Периметр треугольника равен: ";
    cout << P << endl;
}



int main() {
    system("chcp 65001");
    double a, h; // Данные на входе
    //double b=0; //Данные на выходете
    cout << "Введите основу треугольника а: ";
    cin >> a;
    cout << "Введите высоту треугольника h: ";
    cin >> h;
    TriangleP(a, h);
    return 0;
}