//Сотніков Олег 141
//ОписатифункціюDegToRad (D) дійсного типу, яка знаходить величину кута в радіанах, якщо дана його величина D в градусах (D - дійсне
//число, 0 ≤ D <360). Скористатися таким співвідношенням: 180 ° = π радіанів. Як значення π вважатирівним 3.14. За допомогою функціїDegToRad
//перевести з градусів в радіанип'ятьданихкутів.
#include <iostream>
#include <cmath>

using namespace std;

void DegToRad(double D)
{
    if (D >= 0 && D <= 360)
    {
        D = M_PI * D / 180;
    }
    else {
        cout << "Не правильно указано значение D";
    }
    cout << "Значение D в радианах: ";
    cout << D << endl;
}

int main() {
    system("chcp 65001");
    double D; // Данные на входе
    cout << "Введите значение D в градусах:";
    cin >> D;
    DegToRad(D);
    return 0;
}