//1. Напишіть програму, в якій оголошуються ціле Age і вказівник на ціле pAge.
//Задайте адресу цілого вказівнику.За допомогою вказівника встановіть значеyня цілої змінної 25. Виведіть значення змінної Age
//двома способами.
//Сотніков Олег 141

#include <iostream>
using namespace std;
int main() {
	int Age; 
	int* pAge = &Age; 
	*pAge = 25; 

	cout << Age << endl; // ввод
	cout << *pAge << endl; // вывод

	return 0;

}