// Дано три змінні дійсного типу : A, B, C.Якщо їх значення впорядковані за зростанням, то подвоїти їх; 
//в іншому випадку замінити значення кожної змінної на протилежне.Вивести нові значення змінних A, B, C.
//Сотніков Олег 141

#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "RUSSIAN"); //устанавливаем русский язык для консоли

    //обьявление переменных
    double A, B, C;

    cout << "Введите А: ";
    cin >> A;
    cout << "Введите B: ";
    cin >> B;
    cout << "Введите C: ";
    cin >> C;

    if (A < B && B < C) //если А меньше за В    И   В меньше за С, то умножаем значения на 2. 
    {
        A *= 2;
        B *= 2;
        C *= 2;
    }
    else //Чтобы изменить знак на противоположный
    {
        A = -A;
        B = -B;
        C = -C;
    }

    cout << A << endl << B << endl << C;
    return 0;
}