//5 Дано ціле число N(> 0).За допомогою операцій ділення без остачі і взяття залишку від ділення визначити, чи є в запису числа N непарні цифри.
//Якщо є, то вивести true, якщо немає - вивести false.
//Сотніков Олег 141

#include <iostream>
using namespace std;

int main()
{
    //обьявление переменных
    int N;
    bool rez = true;

    cin >> N;

    if (N % 10 == 2) //если остаток от деления на 10, == 2, то значит что в числе есть парные числа.
    {
        rez = false;
    }

    cout << boolalpha << rez;
    return 0;
}