// Дано ціле число N(> 0).Знайти квадрат даного числа, використовуючи для його обчислення наступну формулу :
//N2 = 1 + 3 + 5 + ... + (2 • N - 1).
//Після додавання до суми кожного доданка виводити поточне значення суми(в результаті будуть виведені квадрати всіх цілих чисел від 1 до N).
//Сотніков Олег 141

#include <iostream>
using namespace std;

int main()
{
    //обьявление переменных
    int N = 5;
    int N2 = 0;

    for (int i = 1; i <= N; i++)
    {
        N2 += 2 * i - 1;
        cout << N2 << " ";
    }

    cin.get();

}